RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_common.h
/***************************************************************************//**
* \file cy_capsense_common.h
* \version 3.0
*
* \brief
* This file provides the common CAPSENSE&trade; middleware definitions.
*
********************************************************************************
* \copyright
* Copyright 2018-2021, Cypress Semiconductor Corporation (an Infineon company)
* or an affiliate of Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#if !defined(CY_CAPSENSE_COMMON_H)
#define CY_CAPSENSE_COMMON_H

#include "cy_device_headers.h"
#include "cy_sysint.h"
#include "cycfg_capsense_defines.h"

#if (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3))

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
* Macros
*******************************************************************************/

#if (defined(CY_IP_M0S8CSDV2))

    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC4           (1u)
    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC6           (0u)

    #define CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN       (1u)
    #define CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN        (0u)

    #define CY_CAPSENSE_PSOC4_FOURTH_GEN                (1u)
    #define CY_CAPSENSE_PSOC6_FOURTH_GEN                (0u)
    #define CY_CAPSENSE_PSOC4_FIFTH_GEN                 (0u)

#elif (defined(CY_IP_MXCSDV2))

    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC4           (0u)
    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC6           (1u)

    #define CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN       (1u)
    #define CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN        (0u)

    #define CY_CAPSENSE_PSOC4_FOURTH_GEN                (0u)
    #define CY_CAPSENSE_PSOC6_FOURTH_GEN                (1u)
    #define CY_CAPSENSE_PSOC4_FIFTH_GEN                 (0u)

#elif (defined(CY_IP_M0S8MSCV3))

    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC4           (1u)
    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC6           (0u)

    #define CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN       (0u)
    #define CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN        (1u)

    #define CY_CAPSENSE_PSOC4_FOURTH_GEN                (0u)
    #define CY_CAPSENSE_PSOC6_FOURTH_GEN                (0u)
    #define CY_CAPSENSE_PSOC4_FIFTH_GEN                 (1u)

#endif

#define CY_CAPSENSE_PSOC4_CSDV2                         (CY_CAPSENSE_PSOC4_FOURTH_GEN)
#define CY_CAPSENSE_PSOC6_CSDV2                         (CY_CAPSENSE_PSOC6_FOURTH_GEN)

#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    #include "cy_csd.h"
#else /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */
    #include "cy_msc.h"
#endif

/******************************************************************************/
/** \addtogroup group_capsense_macros_general *//** \{ */
/******************************************************************************/
/** Middleware major version */
#define CY_CAPSENSE_MW_VERSION_MAJOR                    (3)
/** Middleware minor version */
#define CY_CAPSENSE_MW_VERSION_MINOR                    (0)
/** Middleware version */
#define CY_CAPSENSE_MW_VERSION                          (300)

#if (CY_CAPSENSE_PSOC6_FOURTH_GEN)
    /** Defined supported CSD driver version */
    #define CY_CSD_DRV_VERSION_REQUIRED                 (100)

    #if !defined (CY_CSD_DRV2_VERSION)
        /** If CSD driver version not defined by driver then define it here */
        #define CY_CSD_DRV2_VERSION                     (100)
    #else
        /** Use CSD Capture function */
        #define CY_CAPSENSE_USE_CAPTURE                 (1u)
    #endif

    /* Check used driver version */
    #if (CY_CSD_DRV_VERSION_REQUIRED > CY_CSD_DRV2_VERSION)
        #error Some of the features supported by the CAPSENSE&trade; Middleware version CY_CAPSENSE_MW_VERSION require newer version of the PDL. Update the PDL in your project.
    #endif

#endif

#if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
    /** Defined supported CSD driver version */
    #define CY_CSD_DRV_VERSION_REQUIRED                 (100)

    #if !defined (CY_CSD_DRV2_VERSION)
        /** If CSD driver version not defined by driver then define it here */
        #define CY_CSD_DRV2_VERSION                     (100)
    #else
        /** Use CSD Capture function */
        #define CY_CAPSENSE_USE_CAPTURE                 (1u)
    #endif

    /* Check used driver version */
    #if (CY_CSD_DRV_VERSION_REQUIRED > CY_CSD_DRV2_VERSION)
        #error Some of the features supported by the CAPSENSE&trade; Middleware version CY_CAPSENSE_MW_VERSION require newer version of the PDL. Update the PDL in your project.
    #endif

#endif

#if (CY_CAPSENSE_PSOC4_FIFTH_GEN)
    /** Defined supported MSC driver version */
    #define CY_MSC_DRV_VERSION_REQUIRED                 (100)

    #if !defined (CY_MSC_DRV2_VERSION)
        /** If MSC driver version not defined by driver then define it here */
        #define CY_MSC_DRV2_VERSION                     (100)
    #else
        /** Use MSC Capture function */
        #define CY_CAPSENSE_USE_CAPTURE                 (1u)
    #endif

    /* Check used driver version */
    #if (CY_MSC_DRV_VERSION_REQUIRED > CY_MSC_DRV2_VERSION)
        #error Some of the features supported by the CAPSENSE&trade; Middleware version CY_CAPSENSE_MW_VERSION require newer version of the PDL. Update the PDL in your project.
    #endif

#endif

#if !defined (CY_CAPSENSE_USE_CAPTURE)
    /** Use CSD/MSC Init function */
    #define CY_CAPSENSE_USE_CAPTURE                     (0u)
#endif

/** Middleware ID */
#define CY_CAPSENSE_ID                                  (CY_PDL_DRV_ID(0x07uL))


/* Scanning status */
/** The CAPSENSE&trade; middleware is busy */
#define CY_CAPSENSE_BUSY                                (0x80u)
/** The CAPSENSE&trade; middleware is not busy */
#define CY_CAPSENSE_NOT_BUSY                            (0x00u)

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
    /** The CAPSENSE&trade; middleware busy mask */
    #define CY_CAPSENSE_BUSY_MASK                       (0xFFu)
    /** The MSCv3 channel busy mask */
    #define CY_CAPSENSE_BUSY_CH_MASK                    (0x01u)
    /** All MSCv3 channels busy mask */
    #define CY_CAPSENSE_BUSY_ALL_CH_MASK                (0x0Fu)
#endif


/** CAPSENSE&trade; MW initialization is done */
#define CY_CAPSENSE_INIT_DONE                           (1u)
/** CAPSENSE&trade; MW initialization is needed */
#define CY_CAPSENSE_INIT_NEEDED                         (0u)

/** Feature enabled */
#define CY_CAPSENSE_ENABLE                              (1u)
/** Feature disabled */
#define CY_CAPSENSE_DISABLE                             (0u)

/** Sensor active status mask */
#define CY_CAPSENSE_SNS_TOUCH_STATUS_MASK               (0x01u)
/** Proximity active status mask */
#define CY_CAPSENSE_SNS_PROX_STATUS_MASK                (0x02u)
/** Sensor overflow mask */
#define CY_CAPSENSE_SNS_OVERFLOW_MASK                   (0x04u)
/** Widget active status mask */
#define CY_CAPSENSE_WD_ACTIVE_MASK                      (0x01u)
/** Widget disable status mask */
#define CY_CAPSENSE_WD_DISABLE_MASK                     (0x02u)
/** Widget working status mask */
#define CY_CAPSENSE_WD_WORKING_MASK                     (0x04u)
/** \} */

/******************************************************************************/
/** \addtogroup group_capsense_macros_mw_state *//** \{ */
/******************************************************************************/
/** The BIST is currently in progress */
#define CY_CAPSENSE_MW_STATE_BIST_MASK                  (0x800u)
/** The auto-calibration in Single CDAC mode */
#define CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK    (0x1000u)
/** The auto-calibration is currently in progress */
#define CY_CAPSENSE_MW_STATE_CALIBRATION_MASK           (0x2000u)
/** The smart sensing algorithm is currently in progress */
#define CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK            (0x4000u)
/** The middleware initialization is currently in progress */
#define CY_CAPSENSE_MW_STATE_INITIALIZATION_MASK        (0x8000u)
/** The currently active or last scanned slot ID mask */
#define CY_CAPSENSE_MW_STATE_SCAN_SLOT_MASK             (0xFFFF0000u)
/** Current scan slot position in status */
#define CY_CAPSENSE_MW_STATE_SCAN_SLOT_POS              (16u)
/** \} */

/******************************************************************************/
/** \addtogroup group_capsense_macros_settings *//** \{ */
/******************************************************************************/

/** Interrupt Driven scanning mode */
#define CY_CAPSENSE_SCAN_MODE_INT_DRIVEN                (0u)
/** DMA Driven scanning mode */
#define CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN                (1u)

/** Sensor connection method through analog mux bus */
#define CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD       (0u)
/** Sensor connection method through control mux switches */
#define CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD    (1u)

/** CIC filter mode */
#define CY_CAPSENSE_CIC_FILTER                          (0u)
/** CIC2 filter mode */
#define CY_CAPSENSE_CIC2_FILTER                         (1u)

/** Raw count counter mode saturate */
#define CY_CAPSENSE_COUNTER_MODE_SATURATE               (0u)
/** Raw count counter mode overflow */
#define CY_CAPSENSE_COUNTER_MODE_OVERFLOW               (1u)

/** Synchronization mode is disabled */
#define CY_CAPSENSE_SYNC_MODE_OFF                       (0u)
/** Synchronization is external */
#define CY_CAPSENSE_SYNC_EXTERNAL                       (1u)
/** Synchronization is internal */
#define CY_CAPSENSE_SYNC_INTERNAL                       (2u)

