RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_common.h
/** \} */


/******************************************************************************/
/** \addtogroup group_capsense_macros_bist *//** \{ */
/******************************************************************************/
/** The mask for a widget CRC test */
#define CY_CAPSENSE_BIST_CRC_WDGT_MASK                              ((uint32_t)CY_CAPSENSE_TST_WDGT_CRC_EN << 0uL)
/** The mask for a baseline integrity test */
#define CY_CAPSENSE_BIST_BSLN_INTEGRITY_MASK                        ((uint32_t)CY_CAPSENSE_TST_BSLN_INTEGRITY_EN << 1uL)
/** The mask for a rawcount integrity test */
#define CY_CAPSENSE_BIST_RAW_INTEGRITY_MASK                         ((uint32_t)CY_CAPSENSE_TST_RAW_INTEGRITY_EN << 2uL)
/** The mask for a pin integrity test */
#define CY_CAPSENSE_BIST_SNS_INTEGRITY_MASK                         ((uint32_t)CY_CAPSENSE_TST_SNS_SHORT_EN << 3uL)
/** The mask for a sensor capacitance measurement test */
#define CY_CAPSENSE_BIST_SNS_CAP_MASK                               ((uint32_t)CY_CAPSENSE_TST_SNS_CAP_EN << 4uL)
/** The mask for a shield capacitance measurement test */
#define CY_CAPSENSE_BIST_SHIELD_CAP_MASK                            ((uint32_t)CY_CAPSENSE_TST_SH_CAP_EN << 5uL)
#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    /** The mask for an external capacitor capacitance measurement test */
    #define CY_CAPSENSE_BIST_EXTERNAL_CAP_MASK                      ((uint32_t)CY_CAPSENSE_TST_EXTERNAL_CAP_EN << 6uL)
    /** The mask for a VDDA measurement test */
    #define CY_CAPSENSE_BIST_VDDA_MASK                              ((uint32_t)CY_CAPSENSE_TST_VDDA_EN << 7uL)
#else
    /** The mask for an electrode capacitance measurement test */
    #define CY_CAPSENSE_BIST_ELTD_CAP_MASK                          ((uint32_t)CY_CAPSENSE_TST_ELTD_CAP_EN << 8uL)
#endif


#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    /** The mask for all enabled self-test functions */
    #define CY_CAPSENSE_BIST_RUN_AVAILABLE_SELF_TEST_MASK           (CY_CAPSENSE_BIST_CRC_WDGT_MASK | \
                                                                    CY_CAPSENSE_BIST_SNS_INTEGRITY_MASK | \
                                                                    CY_CAPSENSE_BIST_SNS_CAP_MASK | \
                                                                    CY_CAPSENSE_BIST_EXTERNAL_CAP_MASK |\
                                                                    CY_CAPSENSE_BIST_VDDA_MASK |\
                                                                    CY_CAPSENSE_BIST_SHIELD_CAP_MASK)

    /** The mask for all enabled measurement self-test functions */
    #define CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN                    (CY_CAPSENSE_BIST_EN && \
                                                                    (CY_CAPSENSE_TST_SNS_CAP_EN || \
                                                                    CY_CAPSENSE_TST_SH_CAP_EN ||\
                                                                    CY_CAPSENSE_TST_VDDA_EN ||\
                                                                    CY_CAPSENSE_TST_EXTERNAL_CAP_EN))

    /** The mask for all enabled self-test functions which changes HW configuration */
    #define CY_CAPSENSE_TST_HW_GROUP_EN                             (CY_CAPSENSE_BIST_EN && \
                                                                    (CY_CAPSENSE_TST_SNS_SHORT_EN ||\
                                                                    CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN))

#else

    /** The mask for all enabled self-test functions */
    #define CY_CAPSENSE_BIST_RUN_AVAILABLE_SELF_TEST_MASK           (CY_CAPSENSE_BIST_CRC_WDGT_MASK | \
                                                                    CY_CAPSENSE_BIST_SNS_INTEGRITY_MASK | \
                                                                    CY_CAPSENSE_BIST_SNS_CAP_MASK | \
                                                                    CY_CAPSENSE_BIST_ELTD_CAP_MASK | \
                                                                    CY_CAPSENSE_BIST_SHIELD_CAP_MASK)

    /** The mask for all enabled measurement self-test functions */
    #define CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN                    (CY_CAPSENSE_BIST_EN && \
                                                                    (CY_CAPSENSE_TST_SNS_CAP_EN || \
                                                                    CY_CAPSENSE_TST_SH_CAP_EN ||\
                                                                    CY_CAPSENSE_TST_ELTD_CAP_EN))

    /** The mask for all enabled self-test functions which changes HW configuration */
    #define CY_CAPSENSE_TST_HW_GROUP_EN                             (CY_CAPSENSE_BIST_EN && \
                                                                    (CY_CAPSENSE_TST_SNS_SHORT_EN ||\
                                                                    CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN))

#endif

/** \} */


/******************************************************************************/
/** \addtogroup group_capsense_macros_status *//** \{ */
/******************************************************************************/
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Successfully */
#define CY_CAPSENSE_STATUS_SUCCESS                      (0x00u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Bad input parameter */
#define CY_CAPSENSE_STATUS_BAD_PARAM                    (0x01u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Received wrong data */
#define CY_CAPSENSE_STATUS_BAD_DATA                     (0x02u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Timeout */
#define CY_CAPSENSE_STATUS_TIMEOUT                      (0x04u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Invalid state */
#define CY_CAPSENSE_STATUS_INVALID_STATE                (0x08u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Bad configuration */
#define CY_CAPSENSE_STATUS_BAD_CONFIG                   (0x10u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Overflow */
#define CY_CAPSENSE_STATUS_CONFIG_OVERFLOW              (0x20u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: HW is busy */
#define CY_CAPSENSE_STATUS_HW_BUSY                      (0x40u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: HW is locked */
#define CY_CAPSENSE_STATUS_HW_LOCKED                    (0x80u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Unable to perform calibration */
#define CY_CAPSENSE_STATUS_CALIBRATION_FAIL             (0x100u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Calibration scan with the maximum CDAC code is saturated */
#define CY_CAPSENSE_STATUS_CALIBRATION_OVERFLOW         (0x200u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Unable to perform calibration */
#define CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL       (0x400u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Sense Clock Divider
*   is out of the valid range for the specified Clock source configuration 
*/
#define CY_CAPSENSE_STATUS_BAD_CLOCK_CONFIG             (0x800u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Unknown */
#define CY_CAPSENSE_STATUS_UNKNOWN                      (0x80000000u)

/** \} */

#define CY_CAPSENSE_BYTES_IN_16_BITS                    (2u)
#define CY_CAPSENSE_BYTE_IN_32_BIT                      (4u)
#define CY_CAPSENSE_CONVERSION_MEGA                     (1000000u)
#define CY_CAPSENSE_CONVERSION_KILO                     (1000u)
#define CY_CAPSENSE_DIVIDER_TWO                         (2u)
#define CY_CAPSENSE_16_BIT_MASK                         (0xFFFFu)

/*
* These defines are obsolete and kept for backward compatibility only.
* They will be removed in the future versions.
*/
#define CY_CAPSENSE_MDW_VERSION_MAJOR                   (CY_CAPSENSE_MW_VERSION_MAJOR)
#define CY_CAPSENSE_MDW_VERSION_MINOR                   (CY_CAPSENSE_MW_VERSION_MINOR)
#define CY_CAPSENSE_MDW_ID                              (CY_CAPSENSE_ID)
#define CY_CAPSENSE_SW_STS_BUSY                         (CY_CAPSENSE_BUSY)


#if defined(__cplusplus)
}
#endif

#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3)) */

#endif /* CY_CAPSENSE_COMMON_H */


/* [] END OF FILE */
